// BooksList.js
import Book1 from './book1.png';
import Book2 from './book2.jpg';
import Book3 from './book3.jpg';
import Book4 from './book4.jpg';
import Book5 from './book5.jpg';

const booksData = [
  {
    id: 1,
    title: 'Слово про будинок Слово',
    description: 'Ця книжка розкриває особисте життя українських письменників...',
    fullDescription: 'Ця книжка розкриває особисте життя українських письменників, їх творчість, боротьбу за виживання в умовах суспільних змін. Вона пропонує унікальний погляд на інтимність і публічність літературного процесу, розкриваючи глибокі переживання авторів.',
    image: Book1,
    price: 150.00,
  },
  {
    id: 2,
    title: 'Кайдашева сім\'я',
    description: 'Роман Івана Нечуя-Левицького, що зображує життя...',
    fullDescription: 'Роман Івана Нечуя-Левицького "Кайдашева сім\'я" зображує життя селянської родини на фоні соціальних та економічних змін. Через персонажів і їх стосунки автор досліджує проблеми родинних конфліктів, звичаїв та моральних цінностей.',
    image: Book2,
    price: 120.00,
  },
  {
    id: 3,
    title: 'Тигролови',
    description: 'Роман Івана Багряного, що розповідає про боротьбу...',
    fullDescription: 'Роман Івана Багряного "Тигролови" є епічним твором, що розповідає про боротьбу українських повстанців проти радянської влади. В центрі сюжету - непрості стосунки людини і природи, а також теми свободи та гідності.',
    image: Book3,
    price: 200.00,
  },
  {
    id: 4,
    title: 'Кафе на краю світу',
    description: 'Мотивуюча книга Джона Стрелекі про сенс життя і пошуки щастя.',
    fullDescription: 'У "Кафе на краю світу" Джон Стрелекі розповідає про зустріч із трьома важливими запитаннями, які можуть змінити життя. Книга пропонує читачеві задуматися про власні цілі та сенс існування, мотивуючи його шукати справжнє щастя.',
    image: Book4,
    price: 180.00,
  },
  {
    id: 5,
    title: 'Іди туди, де страшно',
    description: 'Книга психолога і коуча Сюзанни Немблін, яка допомагає подолати внутрішні страхи та вийти із зони комфорту.',
    fullDescription: 'Сюзанна Немблін у "Іди туди, де страшно" пропонує стратегії для подолання внутрішніх страхів і сумнівів. Книга містить практичні поради та особисті історії, які надихають читача вийти за межі звичного і досягти успіху в житті.',
    image: Book5,
    price: 160.00,
  },
];

export default booksData;
